cloud_mount.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Thu, 2024-07-18 10:40+0530 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cloud mount</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Cloud mount</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2b7a4c0">Description</a></li>
<li><a href="#org027d641">Setup</a></li>
<li><a href="#orgceb1aab">Code</a>
<ul>
<li><a href="#orga5966d8">Check availability</a></li>
<li><a href="#org5353380">Handle global variables and exits</a></li>
<li><a href="#org6a942a7">Parse command</a></li>
<li><a href="#org17b9527">Mount/Unmount</a></li>
<li><a href="#org92ceb68">Main routine call</a></li>
</ul>
</li>
<li><a href="#org0ada368">References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2b7a4c0" class="outline-2">
<h2 id="org2b7a4c0">Description</h2>
<div class="outline-text-2" id="text-org2b7a4c0">
<p>
mount (unmount) cloud-media using sshfs
</p>
</div>
</div>

<div id="outline-container-org027d641" class="outline-2">
<h2 id="org027d641">Setup</h2>
<div class="outline-text-2" id="text-org027d641">
<p>
Following variables should be declared by adding lines to
<code>${XDG_CONFIG_HOME:-${HOME/.config}/(pvt|local).d/.&lt;some_name&gt;rc</code>
</p>
<ul class="org-ul">
<li>cloud_sship: address (ip/domain name) for ssh</li>
<li>cloud_locs: absolute paths on <code>cloud_sship</code> to mount (space-separated)</li>
<li>cloud_user: user name for ssh</li>
<li><p>
mount_net: network code necessary for <code>cloud_sship</code> to be accessible
</p>
<ul class="org-ul">
<li>1: home</li>
<li>2: work</li>
<li>4: (any) intranet</li>
<li>8: internet</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">cloud_sship</span>=<span class="org-string">"10.0.0.10"</span>
<span class="org-variable-name">cloud_user</span>=<span class="org-string">"weatherman"</span>
<span class="org-variable-name">cloud_locs</span>=<span class="org-string">"/media/shared /home/weatherman"</span>
<span class="org-variable-name">mount_net</span>=2
<span class="org-builtin">export</span> cloud_sship
<span class="org-builtin">export</span> cloud_user
<span class="org-builtin">export</span> cloud_locs
<span class="org-builtin">export</span> mount_net
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgceb1aab" class="outline-2">
<h2 id="orgceb1aab">Code</h2>
<div class="outline-text-2" id="text-orgceb1aab">
<p>
This section tangles source code
</p>
</div>
<div id="outline-container-orga5966d8" class="outline-3">
<h3 id="orga5966d8">Check availability</h3>
<div class="outline-text-3" id="text-orga5966d8">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Confirm that dependencies are available.</span>
<span class="org-function-name">affirm_availability</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">for</span> _import<span class="org-keyword"> in</span> sshfs grep; <span class="org-keyword">do</span>
        <span class="org-keyword">if</span> <span class="org-negation-char">!</span> command -v <span class="org-string">"${_import}"</span> &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
            <span class="org-builtin">unset</span> _import
            clean_exit 127 <span class="org-string">"${_import} is not installed\n"</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">done</span>
    <span class="org-builtin">unset</span> _import
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5353380" class="outline-3">
<h3 id="org5353380">Handle global variables and exits</h3>
<div class="outline-text-3" id="text-org5353380">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Set clean variables before running script.</span>
<span class="org-function-name">set_vars</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2154</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${cloud_sship}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> || <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${cloud_user}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        clean_exit 127 <span class="org-string">"\$cloud_sship AND/OR \$cloud_user is unset\n"</span>
    <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">directory to mount all cloud devices</span>
    <span class="org-variable-name">srv_mnt_dir</span>=
    <span class="org-variable-name">num_locs</span>=0

    <span class="org-comment-delimiter"># </span><span class="org-comment">Mount/"U"Mount</span>
    <span class="org-variable-name">action</span>=<span class="org-string">"mount"</span>

    <span class="org-comment-delimiter">#</span><span class="org-comment">help (usage)</span>
    <span class="org-variable-name">usage</span>=<span class="org-string">"</span>
<span class="org-string">    usage: ${0} -h</span>
<span class="org-string">    usage: ${0} --help</span>
<span class="org-string">"</span>
    <span class="org-comment-delimiter">#</span><span class="org-comment">help (detailed)</span>
    <span class="org-variable-name">help_msg</span>=<span class="org-string">"${usage}</span>

<span class="org-string">    DESCRIPTION:</span>
<span class="org-string">      ssh filesystem mount</span>


<span class="org-string">    Optional Arguments:</span>
<span class="org-string">      -h\t\t\tprint usage message and exit</span>
<span class="org-string">      --help\t\t\tprint this help message and exit</span>

<span class="org-string">    Optional Positional Arguments:</span>
<span class="org-string">      u[n]mount\t\tunmount filesystems</span>
<span class="org-string">"</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Unsetset local variables to clean the environment.</span>
<span class="org-function-name">unset_vars</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-builtin">unset</span> help_msg
    <span class="org-builtin">unset</span> usage
    <span class="org-builtin">unset</span> action
    <span class="org-builtin">unset</span> num_locs
    <span class="org-builtin">unset</span> srv_mnt_dir
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Clean environment and exit optionally with an exit error code</span>
<span class="org-function-name">clean_exit</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    unset_vars
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${1}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${1}"</span> -ne <span class="org-string">"0"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${2}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2059</span>
            printf <span class="org-string">"${2}\n"</span> &gt;&amp;2
        <span class="org-keyword">fi</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2086</span>
        <span class="org-keyword">exit</span> $<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">1</span><span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${2}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2059</span>
        printf <span class="org-string">"${2}\n"</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">exit</span> 0
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a942a7" class="outline-3">
<h3 id="org6a942a7">Parse command</h3>
<div class="outline-text-3" id="text-org6a942a7">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Parse command line arguments</span>
<span class="org-function-name">cli</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-2">[</span> $<span class="org-variable-name">#</span> -gt 0 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">do</span>
        <span class="org-keyword">case</span> <span class="org-string">"${1}"</span><span class="org-keyword"> in</span>
            -h)
                <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2059</span>
                clean_exit 0 <span class="org-string">"${usage}"</span>
                ;;
            --help)
                <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2059</span>
                clean_exit 0 <span class="org-string">"${help_msg}"</span>
                ;;
            unmount|umount)
                <span class="org-variable-name">action</span>=<span class="org-string">"unmount"</span>
                <span class="org-builtin">shift</span>
                ;;
            *)
                clean_exit 1 <span class="org-string">"${usage}"</span>
        <span class="org-keyword">esac</span>
    <span class="org-keyword">done</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org17b9527" class="outline-3">
<h3 id="org17b9527">Mount/Unmount</h3>
<div class="outline-text-3" id="text-org17b9527">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Are we on the right network?</span>
<span class="org-function-name">discover</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">IFS</span>=<span class="org-string">"$(printf '\t')"</span> read -r _ _ netstate &lt;&lt; netcheck
<span class="org-sh-heredoc">$(eval "${RUNCOMDIR}/bin/netcheck.sh")</span>
<span class="org-sh-heredoc">netcheck</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2154</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> $<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span> netstate &amp; mount_net <span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">On home network</span>
        <span class="org-variable-name">srv_mnt_dir</span>=<span class="org-string">"${HOME}/${cloud_sship}"</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2154</span>
        <span class="org-variable-name">num_locs</span>=<span class="org-string">"$(echo "${cloud_locs}" | grep ' ' -c)"</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${clod_locs}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-variable-name">num_locs</span>=<span class="org-string">"$(( num_locs + 1 ))"</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">else</span>
        clean_exit 1 <span class="org-string">"Not on correct network"</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Mount</span>
<span class="org-function-name">mountssh</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$(mount | grep -c "${srv_mnt_dir}")"</span> -lt <span class="org-string">"${num_locs}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">not mounted</span>
        <span class="org-variable-name">CDR</span>=<span class="org-string">"${cloud_locs} "</span>
        <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${CDR}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">do</span>
            <span class="org-variable-name">CAR</span>=<span class="org-string">"${CDR%% *}"</span>
            printf <span class="org-string">"mounting %s -&gt; %s\n"</span> <span class="org-sh-escaped-newline">\</span>
                   <span class="org-string">"${cloud_user}@${cloud_sship}:${CAR}"</span> <span class="org-sh-escaped-newline">\</span>
                   <span class="org-string">"${srv_mnt_dir}${CAR}"</span>
            mkdir -p <span class="org-string">"${srv_mnt_dir}${CAR}"</span>
            sshfs -o <span class="org-sh-escaped-newline">\</span>
                  <span class="org-string">"reconnect,ServerAliveInterval=15,ServerAliveCountMax=3"</span> <span class="org-sh-escaped-newline">\</span>
                  <span class="org-string">"${cloud_user}@${cloud_sship}:${CAR}"</span> <span class="org-string">"${srv_mnt_dir}${CAR}"</span>
            <span class="org-variable-name">CDR</span>=<span class="org-string">"${CDR#* }"</span>;
        <span class="org-keyword">done</span>;
        <span class="org-builtin">unset</span> CAR CDR
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Unmount</span>
<span class="org-function-name">umountssh</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-builtin">set</span> -- <span class="org-string">"${cloud_locs}"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$(mount | grep -c "${srv_mnt_dir}")"</span> -ge <span class="org-string">"${num_locs}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">mounted</span>
        <span class="org-variable-name">CDR</span>=<span class="org-string">"${cloud_locs} "</span>
        <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${CDR}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">do</span>
            <span class="org-variable-name">CAR</span>=<span class="org-string">"${CDR%% *}"</span>
            printf <span class="org-string">"unmounting %s\n"</span> <span class="org-string">"${srv_mnt_dir}${CAR}"</span>
            umount <span class="org-string">"${srv_mnt_dir}${CAR}"</span>
            <span class="org-variable-name">CDR</span>=<span class="org-string">"${CDR#* }"</span>;
        <span class="org-keyword">done</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">unset</span> CAR CDR
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org92ceb68" class="outline-3">
<h3 id="org92ceb68">Main routine call</h3>
<div class="outline-text-3" id="text-org92ceb68">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">main routine call</span>
<span class="org-function-name">main</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    affirm_availability
    set_vars
    cli <span class="org-string">"$@"</span>
    discover
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${action}"</span> = <span class="org-string">'unmount'</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        umountssh
    <span class="org-keyword">else</span>
        mountssh
    <span class="org-keyword">fi</span>
    clean_exit
<span class="org-rainbow-delimiters-depth-1">}</span>

main <span class="org-string">"$@"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0ada368" class="outline-2">
<h2 id="org0ada368">References</h2>
<div class="outline-text-2" id="text-org0ada368">
<ul class="org-ul">
<li>POSIX iterator was inspired by <a href="https://gist.github.com/biiont/290341b29657c0bb2df6">biiont</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pradyumna Paranjape</p>
<p class="date">Created: Thu, 2024-07-18 10:40+0530</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
